Documentation/state/applicazione.org
#+TITLE: State Diagram dell'Applicazione
#+AUTHOR: Valeriy Litkovskyy

All'accensione l'applicazione passa nello stato ~Acceso~.  Dopo di che si
avviano 2 stati paralleli.  Da qualsiasi sottostato di questi stati si può
passare nello stato ~Spento~.

* Stato ~Richiesta Eventi~
  In questo stato vengono richieste tutte le previsioni future che rigiardano i
  CAP preferiti d'utente.  Dopo di si notifica l'utente con possibili
  aggiornamenti delle varie previsioni.  Consecutivamente si passa nello stato
  di ~Sonno 10 secondi~.  Dopo aver aspettato 10 secondi, si ricomincia con la
  richiesta previsioni.

* Stato ~Ricerca Previsioni~
  Si aspetta finché l'utente effettui una ricerca di eventi. Quando viene
  effuttuata una ricerca, vengono richiesti i dati necessari al sistema centrale
  e vengono mostrati gli eventi trovati all'utentie.  Dopo di che si passa di
  nuovo nello stato di ~Aspetto Richiesta~.
